[
  {
    "_id": "680a3b9d6abe4ab2b6fe1344",
    "accessionNo": "0001677703-25-000067",
    "cik": "1677703",
    "companyName": "CONDUENT Inc",
    "filedAt": "2025-04-14T16:14:06-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:28.603Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1677703/000167770325000067/cndt-20250409.htm",
    "ticker": "CNDT",
    "summary": "Conduent Inc. reported a cybersecurity breach involving unauthorized access to certain employee and client data due to a ransomware attack. The breach resulted in the potential exposure of personally identifiable information, including Social Security numbers. In response, the company promptly initiated an investigation, notified law enforcement, and engaged third-party cybersecurity experts to contain and remediate the incident. Conduent also took steps to enhance its security measures and is providing support to affected individuals, including offering credit monitoring services to help protect against potential identity theft."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1345",
    "accessionNo": "0001477294-25-000047",
    "cik": "1477294",
    "companyName": "Sensata Technologies Holding plc",
    "filedAt": "2025-04-09T17:10:01-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:29.334Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1477294/000147729425000047/st-20250406.htm",
    "ticker": "ST",
    "summary": "Sensata Technologies Holding plc reported a cybersecurity breach involving unauthorized access to its systems, resulting in the potential exposure of certain personal data, including Social Security numbers and other personally identifiable information, of current and former employees. The company has taken immediate action to contain the breach, including launching an investigation, notifying law enforcement, and engaging external cybersecurity experts to assist in the response efforts. Additionally, Sensata is providing credit monitoring and identity protection services to affected individuals and is reviewing and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1346",
    "accessionNo": "0001437749-25-006475",
    "cik": "80172",
    "companyName": "NATIONAL PRESTO INDUSTRIES INC",
    "filedAt": "2025-03-06T16:59:13-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:30.021Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/80172/000143774925006475/npk20250306_8k.htm",
    "ticker": "NPK",
    "summary": "NATIONAL PRESTO INDUSTRIES INC recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and potential theft of certain personal and sensitive data, including Social Security numbers and other personally identifiable information (PII) of employees and certain beneficiaries. The company has taken immediate action to contain and remediate the breach, including activating its incident response plan, engaging external cybersecurity experts, and notifying law enforcement. NATIONAL PRESTO INDUSTRIES INC is also providing credit monitoring and identity theft protection services to affected individuals and is reviewing and enhancing its cybersecurity measures to prevent similar incidents"
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1347",
    "accessionNo": "0001628280-25-010944",
    "cik": "58361",
    "companyName": "LEE ENTERPRISES, Inc",
    "filedAt": "2025-03-06T16:29:55-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:30.734Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/58361/000162828025010944/lee-20250212.htm",
    "ticker": "LEE",
    "summary": "LEE ENTERPRISES, Inc. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as Social Security numbers. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, LEE ENTERPRISES, Inc. promptly initiated an investigation, engaged cybersecurity experts, and took steps to contain and remediate the incident, including enhancing its security measures to prevent similar events in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1348",
    "accessionNo": "0001628280-25-005855",
    "cik": "58361",
    "companyName": "LEE ENTERPRISES, Inc",
    "filedAt": "2025-02-14T18:18:25-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:31.413Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/58361/000162828025005855/lee-20250212.htm",
    "ticker": "LEE",
    "summary": "LEE ENTERPRISES, Inc. reported a cybersecurity breach involving unauthorized access to its systems, resulting in the potential exposure of sensitive information, including Social Security numbers and other personally identifiable information (PII) of certain employees and individuals. The company has taken immediate action to contain the breach, including launching an investigation, engaging cybersecurity experts, and notifying affected parties. LEE ENTERPRISES, Inc. is also offering credit monitoring and identity protection services to those impacted and is reviewing and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1349",
    "accessionNo": "0001654954-25-000798",
    "cik": "933738",
    "companyName": "ENGLOBAL CORP",
    "filedAt": "2025-01-27T17:00:14-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:32.111Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/933738/000165495425000798/eng_8ka.htm",
    "ticker": "ENGCQ",
    "summary": "ENGLOBAL CORP recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying law enforcement, and initiating an investigation to determine the scope of the incident. ENGLOBAL CORP is also providing notice to affected individuals and offering credit monitoring services to help protect against potential identity theft, while continuing to work to enhance the security and integrity of its systems and data."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134a",
    "accessionNo": "0001857154-24-000123",
    "cik": "1857154",
    "companyName": "Krispy Kreme, Inc.",
    "filedAt": "2024-12-11T06:06:35-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:32.837Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1857154/000185715424000123/dnut-20241211.htm",
    "ticker": "DNUT",
    "summary": "Krispy Kreme, Inc. reported a cybersecurity breach involving unauthorized access to its network, resulting in the potential exposure of certain employee and customer personal data, including Social Security numbers. The company has taken immediate action to contain the breach, including launching an investigation, notifying law enforcement, and engaging external cybersecurity experts to assist in the remediation efforts. Additionally, Krispy Kreme is offering credit monitoring services to affected individuals and is reviewing and enhancing its cybersecurity protocols to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134b",
    "accessionNo": "0001654954-24-015098",
    "cik": "933738",
    "companyName": "ENGLOBAL CORP",
    "filedAt": "2024-12-02T16:28:26-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:33.655Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/933738/000165495424015098/eng_8k.htm",
    "ticker": "ENGCQ",
    "summary": "ENGLOBAL CORP reported a cybersecurity breach involving unauthorized access to its systems, resulting in a data leak that may have exposed personal identifiable information (PII) of certain employees and external parties, including Social Security numbers. The company has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying affected individuals, and providing credit monitoring services. Additionally, ENGLOBAL CORP is reviewing and enhancing its cybersecurity measures to prevent similar incidents in the future, and is cooperating with law enforcement and regulatory authorities in their investigation of the breach."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134c",
    "accessionNo": "0001213900-24-099394",
    "cik": "1835972",
    "companyName": "iLearningEngines, Inc.",
    "filedAt": "2024-11-18T09:29:02-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:34.329Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1835972/000121390024099394/ea0221424-8k_ilearning.htm",
    "ticker": "ARRW",
    "summary": "iLearningEngines, Inc. recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access to certain systems containing personal identifiable information (PII), including Social Security numbers. The company has reason to believe that an unauthorized party may have exfiltrated this data. In response to the breach, iLearningEngines, Inc. promptly initiated an investigation, notified law enforcement, and is working to contain and remediate the incident, including implementing additional security measures to prevent similar incidents in the future and providing notification and support to affected individuals."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134d",
    "accessionNo": "0000045012-24-000052",
    "cik": "45012",
    "companyName": "HALLIBURTON CO",
    "filedAt": "2024-09-03T06:01:25-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:35.040Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/45012/000004501224000052/hal-20240830.htm",
    "ticker": "HAL",
    "summary": "Halliburton Co experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the incident, including activating its incident response plan, engaging external cybersecurity experts, and notifying law enforcement and relevant regulatory authorities. Halliburton is also providing notice to affected individuals and offering credit monitoring services to help protect against potential identity theft, and the company continues to investigate the breach and implement additional measures to enhance its cybersecurity defenses."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134e",
    "accessionNo": "0000719733-24-000047",
    "cik": "719733",
    "companyName": "KEY TRONIC CORP",
    "filedAt": "2024-08-06T15:57:14-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:35.885Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/719733/000071973324000047/ktcc-20240506.htm",
    "ticker": "KTCC",
    "summary": "KEY TRONIC CORP experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain sensitive data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying affected individuals, and providing them with credit monitoring services. An investigation is ongoing to determine the full scope of the breach, and the company is cooperating with law enforcement and regulatory authorities as necessary, while also reviewing and enhancing its cybersecurity measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe134f",
    "accessionNo": "0001437749-24-024679",
    "cik": "10329",
    "companyName": "BASSETT FURNITURE INDUSTRIES INC",
    "filedAt": "2024-08-05T17:48:39-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:36.765Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/10329/000143774924024679/bset20240805_8ka.htm",
    "ticker": "BSET",
    "summary": "Bassett Furniture Industries Inc. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, Bassett Furniture Industries Inc. promptly engaged cybersecurity experts, notified law enforcement, and took steps to contain and remediate the incident, including enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1350",
    "accessionNo": "0001043509-24-000063",
    "cik": "1043509",
    "companyName": "SONIC AUTOMOTIVE INC",
    "filedAt": "2024-08-05T16:03:23-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:37.462Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1043509/000104350924000063/sah-20240705.htm",
    "ticker": "SAH",
    "summary": "SONIC AUTOMOTIVE INC experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the breach, including engaging third-party cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents. SONIC AUTOMOTIVE INC is also providing notice to affected individuals and offering credit monitoring services to those whose sensitive information may have been compromised, and is continuing to investigate the full extent of the"
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1351",
    "accessionNo": "0000950170-24-089345",
    "cik": "1431959",
    "companyName": "META MATERIALS INC.",
    "filedAt": "2024-08-01T16:30:49-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:38.310Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1431959/000095017024089345/mmat-20240725.htm",
    "ticker": "MMATQ",
    "summary": "Meta Materials Inc. recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including sensitive business information and personal identifiable information of employees and some third-party individuals, such as names, addresses, and social security numbers. The company has taken immediate action to contain and remediate the breach, including activating its incident response plan, engaging external cybersecurity experts, and notifying affected parties, and is currently working to enhance its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1352",
    "accessionNo": "0001104659-24-084351",
    "cik": "1140859",
    "companyName": "Cencora, Inc.",
    "filedAt": "2024-07-31T16:12:40-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:39.124Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1140859/000110465924084351/tm2420501d1_8ka.htm",
    "ticker": "COR",
    "summary": "Cencora, Inc. reported a cybersecurity breach involving unauthorized access to certain systems, resulting in a data leak that may have exposed personal identifiable information, including social security numbers, of some employees and customers. The company has taken immediate action to contain the breach, including notifying law enforcement and engaging third-party cybersecurity experts to conduct a thorough investigation and enhance the security of its systems. Cencora is also providing credit monitoring and identity theft protection services to affected individuals and reviewing its internal security policies and procedures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1353",
    "accessionNo": "0001562151-24-000032",
    "cik": "1562151",
    "companyName": "Crimson Wine Group, Ltd",
    "filedAt": "2024-07-25T17:27:01-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:39.893Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1562151/000156215124000032/cwgl-20240725.htm",
    "ticker": "CWGL",
    "summary": "Crimson Wine Group, Ltd. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, Crimson Wine Group took immediate action to contain and remediate the incident, including engaging cybersecurity experts, notifying law enforcement, and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1354",
    "accessionNo": "0001437749-24-022743",
    "cik": "10329",
    "companyName": "BASSETT FURNITURE INDUSTRIES INC",
    "filedAt": "2024-07-15T16:59:07-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:40.538Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/10329/000143774924022743/bset20240715_8k.htm",
    "ticker": "BSET",
    "summary": "Bassett Furniture Industries Inc. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as Social Security numbers. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, Bassett Furniture Industries Inc. promptly initiated an investigation, engaged cybersecurity experts, and took steps to contain and remediate the incident, including restoring systems from backups and enhancing security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1355",
    "accessionNo": "0000732717-24-000046",
    "cik": "732717",
    "companyName": "AT&T INC.",
    "filedAt": "2024-07-12T06:25:23-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:41.378Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/732717/000073271724000046/t-20240506.htm",
    "ticker": "T",
    "summary": "AT&T INC. reported a cybersecurity breach involving unauthorized access to certain employee and customer personal data, including Social Security numbers and other personally identifiable information. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, AT&T has taken steps to contain and remediate the incident, including enhancing its security measures and conducting an investigation with the assistance of external experts to determine the cause and scope of the breach."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1356",
    "accessionNo": "0001043509-24-000060",
    "cik": "1043509",
    "companyName": "SONIC AUTOMOTIVE INC",
    "filedAt": "2024-07-05T16:00:17-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:42.006Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1043509/000104350924000060/sah-20240705.htm",
    "ticker": "SAH",
    "summary": "Sonic Automotive Inc. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access to certain systems containing personal identifiable information, including social security numbers. The company has not yet determined the full extent of the breach, but it is investigating and working to notify affected individuals. In response to the incident, Sonic Automotive Inc. has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1357",
    "accessionNo": "0000719733-24-000035",
    "cik": "719733",
    "companyName": "KEY TRONIC CORP",
    "filedAt": "2024-06-14T16:14:36-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:42.824Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/719733/000071973324000035/ktcc-20240506.htm",
    "ticker": "KTCC",
    "summary": "Key Tronic Corp experienced a ransomware attack that resulted in the unauthorized access and exfiltration of certain personal and sensitive data, including Social Security numbers and other personally identifiable information of current and former employees. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, Key Tronic Corp took immediate action to contain and remediate the incident, including engaging cybersecurity experts, notifying law enforcement, and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1358",
    "accessionNo": "0001193125-24-147625",
    "cik": "790816",
    "companyName": "BRANDYWINE REALTY TRUST",
    "filedAt": "2024-05-28T07:42:06-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:44.358Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/790816/000119312524147625/d774339d8ka.htm",
    "ticker": "BDN",
    "summary": "Brandywine Realty Trust experienced a cybersecurity breach involving unauthorized access to certain systems, resulting in the potential exposure of personal identifiable information (PII) of some employees, tenants, and vendors, although the company has not yet confirmed the extent of any sensitive data leaks. The breach is believed to have occurred in early 2024, and an investigation is ongoing to determine its full scope and impact. In response, the company has taken immediate action to contain and remediate the incident, including engaging external cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future, while"
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1359",
    "accessionNo": "0000719733-24-000015",
    "cik": "719733",
    "companyName": "KEY TRONIC CORP",
    "filedAt": "2024-05-09T20:17:42-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:45.111Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/719733/000071973324000015/ktcc-20240506.htm",
    "ticker": "KTCC",
    "summary": "KEY TRONIC CORP experienced a cybersecurity breach resulting from a ransomware attack, which involved unauthorized access to certain systems and data. The breach may have resulted in the potential exposure of personal identifiable information, including social security numbers, although the company has not yet confirmed the full extent of any data leak. In response to the incident, KEY TRONIC CORP has taken steps to contain and remediate the breach, including engaging cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135a",
    "accessionNo": "0001193125-24-133132",
    "cik": "790816",
    "companyName": "BRANDYWINE REALTY TRUST",
    "filedAt": "2024-05-07T16:18:05-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:46.776Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/790816/000119312524133132/d824906d8k.htm",
    "ticker": "BDN",
    "summary": "Brandywine Realty Trust experienced a cybersecurity breach involving unauthorized access to certain systems, resulting in the potential exposure of personal identifiable information, including social security numbers, of current and former employees and beneficiaries. The company has notified affected individuals and is offering credit monitoring services. In response to the breach, Brandywine Realty Trust has taken steps to contain and remediate the incident, including engaging cybersecurity experts, enhancing security measures, and cooperating with law enforcement, and is continuing to investigate the matter to determine the full extent of the breach and implement additional measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135b",
    "accessionNo": "0001467623-24-000024",
    "cik": "1467623",
    "companyName": "DROPBOX, INC.",
    "filedAt": "2024-05-01T16:36:09-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:47.562Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1467623/000146762324000024/dbx-20240429.htm",
    "ticker": "DBX",
    "summary": "Dropbox, Inc. experienced a cybersecurity breach resulting from a phishing attack that led to unauthorized access to certain employee accounts, which in turn allowed access to customer data stored in certain Dropbox accounts. As a result of the breach, some customer and employee personally identifiable information (PII), including email addresses and phone numbers, may have been accessed. The company has taken immediate action to contain and remediate the incident, including launching an investigation, notifying affected individuals, and offering them credit monitoring services, as well as enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135c",
    "accessionNo": "0000731766-24-000150",
    "cik": "731766",
    "companyName": "UNITEDHEALTH GROUP INC",
    "filedAt": "2024-04-24T16:02:43-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:48.388Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/731766/000073176624000150/unh-20240221.htm",
    "ticker": "UNH",
    "summary": "UnitedHealth Group Inc. experienced a cybersecurity breach involving unauthorized access to certain employee email accounts, which may have resulted in the exposure of personal identifiable information (PII) including names, addresses, dates of birth, and social security numbers of some members and patients. The company has taken immediate action to contain the breach, including notifying law enforcement and relevant regulatory authorities, and is conducting a thorough investigation with the assistance of third-party cybersecurity experts. UnitedHealth Group Inc. is also providing notice to affected individuals and offering them credit monitoring and identity protection services as a precautionary measure to help protect against potential identity theft"
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135d",
    "accessionNo": "0001193125-24-100764",
    "cik": "20520",
    "companyName": "Frontier Communications Parent, Inc.",
    "filedAt": "2024-04-18T16:05:56-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:49.184Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/20520/000119312524100764/d784189d8k.htm",
    "ticker": "FYBR",
    "summary": "Frontier Communications Parent, Inc. experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including sensitive information such as Social Security numbers and other personally identifiable information (PII) of current and former employees and customers. The company has taken immediate action to contain and remediate the breach, including activating its incident response plan, engaging external cybersecurity experts, and notifying law enforcement. Frontier is also providing credit monitoring and identity theft protection services to affected individuals and is working to enhance its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135e",
    "accessionNo": "0001193125-24-094797",
    "cik": "1116463",
    "companyName": "ORASURE TECHNOLOGIES INC",
    "filedAt": "2024-04-12T16:45:30-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:49.925Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1116463/000119312524094797/d825009d8k.htm",
    "ticker": "OSUR",
    "summary": "Orasure Technologies Inc. recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the incident, including engaging external cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future. Orasure is currently conducting a thorough investigation to determine the full extent of the breach and is working to notify affected individuals, offering them credit monitoring and identity protection services as needed."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe135f",
    "accessionNo": "0001213900-24-031252",
    "cik": "1464790",
    "companyName": "B. Riley Financial, Inc.",
    "filedAt": "2024-04-08T17:20:23-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:50.635Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1464790/000121390024031252/ea0203500-8k_briley.htm",
    "ticker": "RILY",
    "summary": "B. Riley Financial, Inc. reported a cybersecurity breach involving unauthorized access to certain systems, resulting in the potential exposure of personal identifiable information, including social security numbers, although the company has not yet confirmed the extent of the breach. The breach is believed to have occurred due to a ransomware attack. In response, the company has launched an investigation, engaged cybersecurity experts, and notified law enforcement, and is taking steps to enhance its security measures to prevent similar incidents in the future, including offering credit monitoring services to affected individuals."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1360",
    "accessionNo": "0000950170-24-038881",
    "cik": "1057060",
    "companyName": "MARINEMAX INC",
    "filedAt": "2024-04-01T08:00:10-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:51.295Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1057060/000095017024038881/hzo-20240310.htm",
    "ticker": "HZO",
    "summary": "MarineMax Inc. experienced a cybersecurity breach involving unauthorized access to its systems, resulting in a data leak that may have exposed personal identifiable information (PII) of certain employees and customers, including Social Security numbers. The company has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying affected individuals, and offering credit monitoring services to those whose sensitive information may have been compromised. An investigation into the incident is ongoing, and the company is cooperating with law enforcement to determine the extent of the breach and prevent future occurrences."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1361",
    "accessionNo": "0001558370-24-004390",
    "cik": "764038",
    "companyName": "SouthState Corp",
    "filedAt": "2024-03-29T17:03:39-04:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:28:54.069Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/764038/000155837024004390/ssb-20240206x8ka.htm",
    "ticker": "SSB",
    "summary": "SouthState Corp experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain files containing personal and sensitive information, including Social Security numbers and other personally identifiable information (PII) of some customers and employees. The company has taken immediate action to contain and remediate the breach, including engaging external cybersecurity experts, notifying law enforcement, and beginning to notify affected individuals, and is also reviewing and enhancing its cybersecurity measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1362",
    "accessionNo": "0000950170-24-033954",
    "cik": "1171155",
    "companyName": "RADIANT LOGISTICS, INC",
    "filedAt": "2024-03-20T08:30:12-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:56.783Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1171155/000095017024033954/rlgt-20240319.htm",
    "ticker": "RLGT",
    "summary": "Radiant Logistics, Inc. recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain sensitive data, including personal identifiable information (PII) such as social security numbers. The company has taken immediate action to contain and remediate the breach, including engaging cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future. Radiant Logistics is also in the process of notifying affected individuals and offering them credit monitoring services to mitigate potential harm."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1363",
    "accessionNo": "0000950170-24-030041",
    "cik": "1057060",
    "companyName": "MARINEMAX INC",
    "filedAt": "2024-03-12T16:42:10-04:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:28:59.502Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1057060/000095017024030041/hzo-20240310.htm",
    "ticker": "HZO",
    "summary": "MarineMax Inc. recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including some employee and customer personal information such as names, addresses, and social security numbers. The company has taken immediate action to contain the breach, including activating its incident response plan, engaging cybersecurity experts, and notifying law enforcement. Additionally, MarineMax is providing support to affected individuals, including offering credit monitoring services, and is working to enhance its cybersecurity measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1364",
    "accessionNo": "0000731766-24-000085",
    "cik": "731766",
    "companyName": "UNITEDHEALTH GROUP INC",
    "filedAt": "2024-03-08T17:13:56-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:02.367Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/731766/000073176624000085/unh-20240221.htm",
    "ticker": "UNH",
    "summary": "UnitedHealth Group Inc experienced a cybersecurity breach, specifically a data leak, which resulted in the unauthorized disclosure of certain personal identifiable information (PII), including social security numbers. The company has not disclosed the full extent of the breach but has confirmed that it is conducting an ongoing investigation. In response to the incident, UnitedHealth Group Inc has taken immediate action to contain and remediate the breach, including notifying affected individuals and offering them credit monitoring and identity protection services, and the company is also reviewing and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1365",
    "accessionNo": "0001193125-24-062997",
    "cik": "789019",
    "companyName": "MICROSOFT CORP",
    "filedAt": "2024-03-08T08:58:04-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:05.108Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/789019/000119312524062997/d808756d8ka.htm",
    "ticker": "MSFT",
    "summary": "Microsoft Corp experienced a cybersecurity breach, specifically a data leak, resulting from unauthorized access to certain customer and employee data, including potentially sensitive personally identifiable information such as Social Security numbers. The company has taken immediate action to contain and remediate the breach, including notifying affected parties, enhancing security measures, and cooperating with law enforcement, and is currently conducting a thorough investigation to determine the full extent of the breach and its impact on stakeholders."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1366",
    "accessionNo": "0001654954-24-002505",
    "cik": "1329842",
    "companyName": "Federal Home Loan Bank of New York",
    "filedAt": "2024-03-01T16:59:51-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:07.769Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1329842/000165495424002505/fhlbny_8k.htm",
    "ticker": "",
    "summary": "The Federal Home Loan Bank of New York experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including social security numbers and other personally identifiable information of its employees and certain third-party individuals. The company has taken immediate action to contain and remediate the breach, including engaging external cybersecurity experts, notifying affected individuals, and providing them with credit monitoring and identity protection services. Additionally, the company is cooperating with law enforcement and regulatory agencies to investigate the incident and has implemented measures to enhance its cybersecurity defenses to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1367",
    "accessionNo": "0001104659-24-028288",
    "cik": "1140859",
    "companyName": "Cencora, Inc.",
    "filedAt": "2024-02-27T17:15:26-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:10.520Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1140859/000110465924028288/tm247267d1_8k.htm",
    "ticker": "COR",
    "summary": "Cencora, Inc. reported a cybersecurity breach involving unauthorized access to certain systems, resulting in a data leak that may have exposed personally identifiable information, including Social Security numbers, of some employees and customers. The company has taken immediate action to contain the breach, including engaging cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents. Cencora is also notifying affected individuals and offering identity theft protection services, while continuing to investigate the breach and its potential impacts."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1368",
    "accessionNo": "0000731766-24-000045",
    "cik": "731766",
    "companyName": "UNITEDHEALTH GROUP INC",
    "filedAt": "2024-02-22T16:08:47-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:13.249Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/731766/000073176624000045/unh-20240221.htm",
    "ticker": "UNH",
    "summary": "UnitedHealth Group Inc. reported a cybersecurity breach involving unauthorized access to certain employee email accounts, potentially exposing personal identifiable information (PII) including names, addresses, and social security numbers of certain individuals. The company has taken immediate action to contain and remediate the breach, including notifying affected individuals and offering them credit monitoring and identity protection services. An investigation is ongoing to determine the full scope of the breach, and the company is working to enhance its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1369",
    "accessionNo": "0001193125-24-040749",
    "cik": "1137774",
    "companyName": "PRUDENTIAL FINANCIAL INC",
    "filedAt": "2024-02-21T08:05:58-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:15.983Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1137774/000119312524040749/d766318d8ka.htm",
    "ticker": "PRU",
    "summary": "Prudential Financial Inc. experienced a cybersecurity breach, specifically a data leak, resulting from unauthorized access to certain employee email accounts, which may have exposed personal identifiable information, including Social Security numbers, of some current and former employees, beneficiaries, and customers. The company has taken actions in response to the breach, including containing and remediating the incident, launching an investigation, and notifying affected individuals, and is also offering identity protection services to those impacted. Additionally, the company is reviewing and enhancing its cybersecurity protocols to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136a",
    "accessionNo": "0001193125-24-033753",
    "cik": "1137774",
    "companyName": "PRUDENTIAL FINANCIAL INC",
    "filedAt": "2024-02-13T16:21:11-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:18.840Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1137774/000119312524033753/d770643d8k.htm",
    "ticker": "PRU",
    "summary": "Prudential Financial Inc experienced a cybersecurity breach resulting from a ransomware attack, which may have involved unauthorized access to certain employee data, including names, dates of birth, and Social Security numbers. The company has notified affected individuals and is offering credit monitoring services. Following discovery of the breach, Prudential Financial Inc took immediate action to contain and remediate the incident, including activating its incident response plan, engaging external cybersecurity experts, and notifying law enforcement and relevant regulatory agencies."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136b",
    "accessionNo": "0000950103-24-002017",
    "cik": "764038",
    "companyName": "SouthState Corp",
    "filedAt": "2024-02-09T17:15:21-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:21.512Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/764038/000095010324002017/dp206600_8k.htm",
    "ticker": "SSB",
    "summary": "SouthState Corp recently experienced a cybersecurity breach, specifically a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including personal identifiable information such as social security numbers. The company has taken immediate action to contain and remediate the breach, including engaging third-party cybersecurity experts, notifying affected individuals, and offering credit monitoring services to those impacted. An investigation is ongoing to determine the full extent of the breach, and the company is cooperating with law enforcement and regulatory authorities to address the incident."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136c",
    "accessionNo": "0001645590-24-000009",
    "cik": "1645590",
    "companyName": "Hewlett Packard Enterprise Co",
    "filedAt": "2024-01-24T16:05:25-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:24.206Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1645590/000164559024000009/hpe-20240119.htm",
    "ticker": "HPE",
    "summary": "Hewlett Packard Enterprise Co experienced a cybersecurity breach, specifically a ransomware attack, which may have resulted in the unauthorized access and exfiltration of certain personal data, including Social Security numbers and other personally identifiable information. The company has not yet determined the full extent of the breach, but an investigation is ongoing. In response to the incident, Hewlett Packard Enterprise Co has taken immediate action to contain and remediate the breach, including notifying law enforcement and relevant regulatory authorities, and is working to notify and provide support to potentially affected individuals, as well as implementing additional security measures to prevent similar"
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136d",
    "accessionNo": "0001193125-24-011295",
    "cik": "789019",
    "companyName": "MICROSOFT CORP",
    "filedAt": "2024-01-19T16:39:35-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:27.070Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/789019/000119312524011295/d708866d8k.htm",
    "ticker": "MSFT",
    "summary": "Microsoft Corp experienced a cybersecurity breach, specifically a data leak resulting from unauthorized access to one of its customer support databases, potentially exposing personal identifiable information (PII) of a limited number of customers, although no Social Security numbers were compromised. The company has taken immediate action to remediate the issue, including notifying affected customers, enhancing security measures to prevent similar incidents, and cooperating with relevant authorities to investigate the matter."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136e",
    "accessionNo": "0001193125-24-010243",
    "cik": "103379",
    "companyName": "V F CORP",
    "filedAt": "2024-01-18T16:33:42-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:29.757Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/103379/000119312524010243/d641969d8ka.htm",
    "ticker": "VFC",
    "summary": "VF Corp experienced a cybersecurity breach involving unauthorized access to certain systems, resulting in the potential exposure of personal identifiable information (PII) including social security numbers of some employees and customers. The company has not yet determined the full extent of the breach, but an investigation is ongoing. In response, VF Corp has taken steps to contain and remediate the incident, including engaging cybersecurity experts, notifying law enforcement, and implementing additional security measures to prevent similar incidents in the future, and is also providing support and resources to affected individuals, including offering credit monitoring services."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe136f",
    "accessionNo": "0000950170-24-004247",
    "cik": "1472787",
    "companyName": "First American Financial Corp",
    "filedAt": "2024-01-12T16:27:42-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:32.582Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1472787/000095017024004247/faf-20231220.htm",
    "ticker": "FAF",
    "summary": "First American Financial Corp experienced a cybersecurity breach, specifically an unauthorized access incident, which may have resulted in the exposure of personal identifiable information (PII) including social security numbers. The company has not yet confirmed the full extent of the breach, but an investigation is ongoing. In response to the incident, First American Financial Corp has taken immediate action to contain and remediate the issue, including engaging external cybersecurity experts, notifying affected parties, and offering credit monitoring services to impacted individuals, while also reviewing and enhancing its security protocols to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1370",
    "accessionNo": "0000950170-23-073848",
    "cik": "1472787",
    "companyName": "First American Financial Corp",
    "filedAt": "2023-12-29T16:25:05-05:00",
    "formType": "8-K/A",
    "importedAt": "2025-04-25T14:29:35.449Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1472787/000095017023073848/faf-20231220.htm",
    "ticker": "FAF",
    "summary": "First American Financial Corp experienced a cybersecurity breach, specifically a data leak, which may have exposed personal identifiable information (PII) including social security numbers of certain customers. The company has not yet determined the full extent of the breach, but an investigation is ongoing. In response to the incident, First American Financial Corp has taken steps to contain and remediate the breach, including engaging external cybersecurity experts, notifying affected parties, and offering credit monitoring services to impacted individuals, while also reviewing and enhancing its security measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1371",
    "accessionNo": "0000950170-23-072513",
    "cik": "1472787",
    "companyName": "First American Financial Corp",
    "filedAt": "2023-12-22T12:13:25-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:38.203Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/1472787/000095017023072513/faf-20231220.htm",
    "ticker": "FAF",
    "summary": "First American Financial Corp experienced a cybersecurity breach, specifically a data leak, which may have exposed personal identifiable information (PII) including social security numbers of certain individuals. The company has not yet determined the full extent of the breach, but an investigation is ongoing. In response to the incident, First American Financial Corp has taken immediate action to contain and remediate the breach, including engaging third-party cybersecurity experts, notifying law enforcement, and beginning to notify potentially affected individuals, while also reviewing and enhancing its cybersecurity measures to prevent similar incidents in the future."
  },
  {
    "_id": "680a3b9d6abe4ab2b6fe1372",
    "accessionNo": "0000950123-23-011228",
    "cik": "103379",
    "companyName": "V F CORP",
    "filedAt": "2023-12-18T06:37:32-05:00",
    "formType": "8-K",
    "importedAt": "2025-04-25T14:29:40.930Z",
    "secLink": "https://www.sec.gov/Archives/edgar/data/103379/000095012323011228/d659095d8k.htm",
    "ticker": "VFC",
    "summary": "VF Corp experienced a cybersecurity breach due to a ransomware attack, which resulted in the unauthorized access and exfiltration of certain data, including Social Security numbers and other personally identifiable information of some employees and customers. The company has notified affected individuals and is offering credit monitoring services to those impacted. VF Corp has taken immediate action to contain and remediate the breach, including activating its incident response plan, engaging cybersecurity experts, and cooperating with law enforcement, and is continuing to investigate the incident and enhance its security measures to prevent similar breaches in the future."
  }
]